content/emacs/emacs-configs.org
#+TITLE: Emacs Configurations
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+OPTIONS: toc:2 num:3
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results none

* Introduction

This is my comprehensive Emacs configuration written in a literate programming style using Org-mode. The configuration is split into modular sections for better organization and maintainability.

** How This Works

- *Tangling*: Since configurations are modular, you can:
  - Run =./tangle.sh= from the repository root (recommended - handles all files recursively)
  - Tangle individual files: Open a config file and run =C-c C-v t=
  - Use the Elisp helper: See "Tangling All Configurations" section below
- *Exporting*: Use =C-c C-e h h= to export this document to HTML for publishing
- *Modular Structure*: Configuration files are organized in =configs/= with subdirectories:
  - Top-level files for core Emacs settings
  - =programming/= for language-specific configurations
  - =documentation/= for document format configurations (Org-mode, Markdown)

** Quick Start

1. Clone this repository
2. Run =./tangle.sh= from the repository root (recommended)
3. Restart Emacs

Alternative methods:
- *From Emacs*: Navigate to "Tangling All Configurations" section and execute the code block (=C-c C-c=)
- *Individual files*: Open a config file and run =C-c C-v t=

** File Structure

The configuration is organized as follows:

- *Early Init* - Performance optimizations that must load before anything else
- *Init* - Core Emacs settings and built-in packages
- *Theme* - Visual appearance and mode line configuration
- *Window* - Window management and layout
- *Completion* - Completion frameworks and interfaces
- *Dired* - Directory editor enhancements
- *Documentation* - Modular documentation system (Org-mode, Markdown)
  - General documentation tools
  - Org-mode configurations
  - Markdown configurations
- *Shell* - Terminal and shell integration
- *Programming* - Modular language-specific configurations
  - General programming tools
  - Web development (HTML/CSS/JS/TypeScript)
  - Python development
  - Ruby development
- *Miscellaneous* - Utilities and helper functions
- *Platform-Specific* - OS-specific configurations

* Tangling All Configurations

** Using tangle.sh (Recommended)

The repository includes a =tangle.sh= script that automatically finds and tangles all configuration files recursively:

#+begin_src shell
./tangle.sh
#+end_src

This script:
- Recursively processes all =.org= files in =content/emacs/configs/=
- Includes subdirectories (=programming/=, =documentation/=)
- Creates required directories (=~/.emacs.d/elisp/=)
- Shows progress for each file

** Using Elisp Helper (Alternative)

Alternatively, execute this code block from within Emacs by placing your cursor inside it and running =C-c C-c=:

#+begin_src emacs-lisp :results silent
  (let ((default-directory (file-name-directory (buffer-file-name)))
        (config-files '("configs/01-early-init.org"
                        "configs/02-init.org"
                        "configs/03-theme.org"
                        "configs/04-window.org"
                        "configs/05-completion.org"
                        "configs/06-dired.org"
                        "configs/07-docs.org"
                        "configs/documentation/00-loader.org"
                        "configs/documentation/01-general.org"
                        "configs/documentation/02-org.org"
                        "configs/documentation/03-md.org"
                        "configs/08-shell.org"
                        "configs/09-programming.org"
                        "configs/programming/00-loader.org"
                        "configs/programming/01-general.org"
                        "configs/programming/02-web.org"
                        "configs/programming/03-python.org"
                        "configs/programming/04-ruby.org"
                        "configs/10-miscellaneous.org"
                        "configs/11-platform-linux.org"
                        "configs/12-platform-macos.org"
                        "configs/13-platform-windows.org")))
    (dolist (file config-files)
      (let ((filepath (expand-file-name file)))
        (when (file-exists-p filepath)
          (message "Tangling %s..." file)
          (org-babel-tangle-file filepath))))
    (message "All configurations tangled successfully!"))
#+end_src

This will process all config files and extract their code blocks to =~/.emacs.d/=.

* Configuration Sections

** [[file:configs/01-early-init.org][Early Initialization]]
** [[file:configs/02-init.org][Core Initialization]]
** [[file:configs/03-theme.org][Theme and Appearance]]
** [[file:configs/04-window.org][Window Management]]
** [[file:configs/05-completion.org][Completion System]]
** [[file:configs/06-dired.org][Directory Editor (Dired)]]
** [[file:configs/07-docs.org][Documentation (Org-mode & Markdown)]]

*** Documentation Modules

The documentation configuration is modular and includes:
- [[file:configs/documentation/00-loader.org][Loader]] - Orchestrates all documentation configs
- [[file:configs/documentation/01-general.org][General]] - Common documentation tools (olivetti, etc.)
- [[file:configs/documentation/02-org.org][Org-mode]] - Org-mode specific configurations
- [[file:configs/documentation/03-md.org][Markdown]] - Markdown mode configurations

** [[file:configs/08-shell.org][Shell Integration]]
** [[file:configs/09-programming.org][Programming Languages]]

*** Programming Modules

The programming configuration is modular and includes:
- [[file:configs/programming/00-loader.org][Loader]] - Orchestrates all programming configs
- [[file:configs/programming/01-general.org][General]] - Common programming tools (LSP, Magit, etc.)
- [[file:configs/programming/02-web.org][Web Development]] - HTML, CSS, JavaScript, TypeScript
- [[file:configs/programming/03-python.org][Python]] - Python development environment
- [[file:configs/programming/04-ruby.org][Ruby]] - Ruby development environment

** [[file:configs/10-miscellaneous.org][Miscellaneous]]

** Platform-Specific Configurations

*** [[file:configs/11-platform-linux.org][Linux-Specific Configuration]]
*** [[file:configs/12-platform-macos.org][macOS-Specific Configuration]]
*** [[file:configs/13-platform-windows.org][Windows-Specific Configuration]]

* Local File Variables                                                          :noexport:

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
