emacs/emacs-configs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configurations</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Emacs Configurations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1bd8e8">1. Introduction</a>
<ul>
<li><a href="#orgcfe2601">1.1. How This Works</a></li>
<li><a href="#org0913e7d">1.2. Quick Start</a></li>
<li><a href="#orgc32a2b0">1.3. File Structure</a></li>
</ul>
</li>
<li><a href="#org52e4c86">2. Tangling All Configurations</a>
<ul>
<li><a href="#org3ba57a7">2.1. Using tangle.sh (Recommended)</a></li>
<li><a href="#orgdaac882">2.2. Using Elisp Helper (Alternative)</a></li>
</ul>
</li>
<li><a href="#org2b9725d">3. Configuration Sections</a>
<ul>
<li><a href="#org766383d">3.1. Early Initialization</a></li>
<li><a href="#orga2b8eb3">3.2. Core Initialization</a></li>
<li><a href="#orgee4e364">3.3. Theme and Appearance</a></li>
<li><a href="#org364c485">3.4. Window Management</a></li>
<li><a href="#org82b72de">3.5. Completion System</a></li>
<li><a href="#org9c57364">3.6. Directory Editor (Dired)</a></li>
<li><a href="#org62d6365">3.7. Documentation (Org-mode &amp; Markdown)</a></li>
<li><a href="#orgfb6c1da">3.8. Shell Integration</a></li>
<li><a href="#org90b197b">3.9. Programming Languages</a></li>
<li><a href="#org24f3c1d">3.10. Miscellaneous</a></li>
<li><a href="#org27717c2">3.11. Platform-Specific Configurations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1bd8e8" class="outline-2">
<h2 id="orgc1bd8e8"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my comprehensive Emacs configuration written in a literate programming style using Org-mode. The configuration is split into modular sections for better organization and maintainability.
</p>
</div>

<div id="outline-container-orgcfe2601" class="outline-3">
<h3 id="orgcfe2601"><span class="section-number-3">1.1.</span> How This Works</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Tangling</b>: Since configurations are modular, you can:
<ul class="org-ul">
<li>Run <code>./tangle.sh</code> from the repository root (recommended - handles all files recursively)</li>
<li>Tangle individual files: Open a config file and run <code>C-c C-v t</code></li>
<li>Use the Elisp helper: See "Tangling All Configurations" section below</li>
</ul></li>
<li><b>Exporting</b>: Use <code>C-c C-e h h</code> to export this document to HTML for publishing</li>
<li><b>Modular Structure</b>: Configuration files are organized in <code>configs/</code> with subdirectories:
<ul class="org-ul">
<li>Top-level files for core Emacs settings</li>
<li><code>programming/</code> for language-specific configurations</li>
<li><code>documentation/</code> for document format configurations (Org-mode, Markdown)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0913e7d" class="outline-3">
<h3 id="org0913e7d"><span class="section-number-3">1.2.</span> Quick Start</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Clone this repository</li>
<li>Run <code>./tangle.sh</code> from the repository root (recommended)</li>
<li>Restart Emacs</li>
</ol>

<p>
Alternative methods:
</p>
<ul class="org-ul">
<li><b>From Emacs</b>: Navigate to "Tangling All Configurations" section and execute the code block (<code>C-c C-c</code>)</li>
<li><b>Individual files</b>: Open a config file and run <code>C-c C-v t</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgc32a2b0" class="outline-3">
<h3 id="orgc32a2b0"><span class="section-number-3">1.3.</span> File Structure</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The configuration is organized as follows:
</p>

<ul class="org-ul">
<li><b>Early Init</b> - Performance optimizations that must load before anything else</li>
<li><b>Init</b> - Core Emacs settings and built-in packages</li>
<li><b>Theme</b> - Visual appearance and mode line configuration</li>
<li><b>Window</b> - Window management and layout</li>
<li><b>Completion</b> - Completion frameworks and interfaces</li>
<li><b>Dired</b> - Directory editor enhancements</li>
<li><b>Documentation</b> - Modular documentation system (Org-mode, Markdown)
<ul class="org-ul">
<li>General documentation tools</li>
<li>Org-mode configurations</li>
<li>Markdown configurations</li>
</ul></li>
<li><b>Shell</b> - Terminal and shell integration</li>
<li><b>Programming</b> - Modular language-specific configurations
<ul class="org-ul">
<li>General programming tools</li>
<li>Web development (HTML/CSS/JS/TypeScript)</li>
<li>Python development</li>
<li>Ruby development</li>
</ul></li>
<li><b>Miscellaneous</b> - Utilities and helper functions</li>
<li><b>Platform-Specific</b> - OS-specific configurations</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org52e4c86" class="outline-2">
<h2 id="org52e4c86"><span class="section-number-2">2.</span> Tangling All Configurations</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3ba57a7" class="outline-3">
<h3 id="org3ba57a7"><span class="section-number-3">2.1.</span> Using tangle.sh (Recommended)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The repository includes a <code>tangle.sh</code> script that automatically finds and tangles all configuration files recursively:
</p>

<div class="org-src-container">
<pre class="src src-shell">./tangle.sh
</pre>
</div>

<p>
This script:
</p>
<ul class="org-ul">
<li>Recursively processes all <code>.org</code> files in <code>content/emacs/configs/</code></li>
<li>Includes subdirectories (<code>programming/</code>, <code>documentation/</code>)</li>
<li>Creates required directories (<code>~/.emacs.d/elisp/</code>)</li>
<li>Shows progress for each file</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaac882" class="outline-3">
<h3 id="orgdaac882"><span class="section-number-3">2.2.</span> Using Elisp Helper (Alternative)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Alternatively, execute this code block from within Emacs by placing your cursor inside it and running <code>C-c C-c</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">let</span> ((default-directory (file-name-directory (buffer-file-name)))
      (config-files '(<span class="org-string">"configs/01-early-init.org"</span>
                      <span class="org-string">"configs/02-init.org"</span>
                      <span class="org-string">"configs/03-theme.org"</span>
                      <span class="org-string">"configs/04-window.org"</span>
                      <span class="org-string">"configs/05-completion.org"</span>
                      <span class="org-string">"configs/06-dired.org"</span>
                      <span class="org-string">"configs/07-docs.org"</span>
                      <span class="org-string">"configs/documentation/00-loader.org"</span>
                      <span class="org-string">"configs/documentation/01-general.org"</span>
                      <span class="org-string">"configs/documentation/02-org.org"</span>
                      <span class="org-string">"configs/documentation/03-md.org"</span>
                      <span class="org-string">"configs/08-shell.org"</span>
                      <span class="org-string">"configs/09-programming.org"</span>
                      <span class="org-string">"configs/programming/00-loader.org"</span>
                      <span class="org-string">"configs/programming/01-general.org"</span>
                      <span class="org-string">"configs/programming/02-web.org"</span>
                      <span class="org-string">"configs/programming/03-python.org"</span>
                      <span class="org-string">"configs/programming/04-ruby.org"</span>
                      <span class="org-string">"configs/10-miscellaneous.org"</span>
                      <span class="org-string">"configs/11-platform-linux.org"</span>
                      <span class="org-string">"configs/12-platform-macos.org"</span>
                      <span class="org-string">"configs/13-platform-windows.org"</span>)))
  (<span class="org-keyword">dolist</span> (file config-files)
    (<span class="org-keyword">let</span> ((filepath (expand-file-name file)))
      (<span class="org-keyword">when</span> (file-exists-p filepath)
        (message <span class="org-string">"Tangling %s..."</span> file)
        (org-babel-tangle-file filepath))))
  (message <span class="org-string">"All configurations tangled successfully!"</span>))
</pre>
</div>

<p>
This will process all config files and extract their code blocks to <code>~/.emacs.d/</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org2b9725d" class="outline-2">
<h2 id="org2b9725d"><span class="section-number-2">3.</span> Configuration Sections</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org766383d" class="outline-3">
<h3 id="org766383d"><span class="section-number-3">3.1.</span> <a href="configs/01-early-init.html">Early Initialization</a></h3>
</div>
<div id="outline-container-orga2b8eb3" class="outline-3">
<h3 id="orga2b8eb3"><span class="section-number-3">3.2.</span> <a href="configs/02-init.html">Core Initialization</a></h3>
</div>
<div id="outline-container-orgee4e364" class="outline-3">
<h3 id="orgee4e364"><span class="section-number-3">3.3.</span> <a href="configs/03-theme.html">Theme and Appearance</a></h3>
</div>
<div id="outline-container-org364c485" class="outline-3">
<h3 id="org364c485"><span class="section-number-3">3.4.</span> <a href="configs/04-window.html">Window Management</a></h3>
</div>
<div id="outline-container-org82b72de" class="outline-3">
<h3 id="org82b72de"><span class="section-number-3">3.5.</span> <a href="configs/05-completion.html">Completion System</a></h3>
</div>
<div id="outline-container-org9c57364" class="outline-3">
<h3 id="org9c57364"><span class="section-number-3">3.6.</span> <a href="configs/06-dired.html">Directory Editor (Dired)</a></h3>
</div>
<div id="outline-container-org62d6365" class="outline-3">
<h3 id="org62d6365"><span class="section-number-3">3.7.</span> <a href="configs/07-docs.html">Documentation (Org-mode &amp; Markdown)</a></h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-org47eccd2" class="outline-4">
<h4 id="org47eccd2"><span class="section-number-4">3.7.1.</span> Documentation Modules</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
The documentation configuration is modular and includes:
</p>
<ul class="org-ul">
<li><a href="configs/documentation/00-loader.html">Loader</a> - Orchestrates all documentation configs</li>
<li><a href="configs/documentation/01-general.html">General</a> - Common documentation tools (olivetti, etc.)</li>
<li><a href="configs/documentation/02-org.html">Org-mode</a> - Org-mode specific configurations</li>
<li><a href="configs/documentation/03-md.html">Markdown</a> - Markdown mode configurations</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfb6c1da" class="outline-3">
<h3 id="orgfb6c1da"><span class="section-number-3">3.8.</span> <a href="configs/08-shell.html">Shell Integration</a></h3>
</div>
<div id="outline-container-org90b197b" class="outline-3">
<h3 id="org90b197b"><span class="section-number-3">3.9.</span> <a href="configs/09-programming.html">Programming Languages</a></h3>
<div class="outline-text-3" id="text-3-9">
</div>
<div id="outline-container-org262a28e" class="outline-4">
<h4 id="org262a28e"><span class="section-number-4">3.9.1.</span> Programming Modules</h4>
<div class="outline-text-4" id="text-3-9-1">
<p>
The programming configuration is modular and includes:
</p>
<ul class="org-ul">
<li><a href="configs/programming/00-loader.html">Loader</a> - Orchestrates all programming configs</li>
<li><a href="configs/programming/01-general.html">General</a> - Common programming tools (LSP, Magit, etc.)</li>
<li><a href="configs/programming/02-web.html">Web Development</a> - HTML, CSS, JavaScript, TypeScript</li>
<li><a href="configs/programming/03-python.html">Python</a> - Python development environment</li>
<li><a href="configs/programming/04-ruby.html">Ruby</a> - Ruby development environment</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org24f3c1d" class="outline-3">
<h3 id="org24f3c1d"><span class="section-number-3">3.10.</span> <a href="configs/10-miscellaneous.html">Miscellaneous</a></h3>
</div>

<div id="outline-container-org27717c2" class="outline-3">
<h3 id="org27717c2"><span class="section-number-3">3.11.</span> Platform-Specific Configurations</h3>
<div class="outline-text-3" id="text-3-11">
</div>
<div id="outline-container-org008069c" class="outline-4">
<h4 id="org008069c"><span class="section-number-4">3.11.1.</span> <a href="configs/11-platform-linux.html">Linux-Specific Configuration</a></h4>
</div>
<div id="outline-container-org2246fca" class="outline-4">
<h4 id="org2246fca"><span class="section-number-4">3.11.2.</span> <a href="configs/12-platform-macos.html">macOS-Specific Configuration</a></h4>
</div>
<div id="outline-container-orga84acfa" class="outline-4">
<h4 id="orga84acfa"><span class="section-number-4">3.11.3.</span> <a href="configs/13-platform-windows.html">Windows-Specific Configuration</a></h4>
</div>
</div>
</div>
</main>
</body>
</html>
